Revit 2027 API
ExternalDataManagerCommandId Constructor
Creates a new ExternalDataManagerCommandId instance.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalDataManagerCommandId(
	Guid guid
)
Public Sub New (
	guid As Guid
)
public:
ExternalDataManagerCommandId(
	Guid guid
)
new :
        guid : Guid -> ExternalDataManagerCommandId
Parameters
guid Guid
The identifier for the ExternalDataManagerCommandId.
See Also
Reference
ExternalDataManagerCommandId Class
Autodesk.Revit.UI Namespace